In [19]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '@Ravenclaw93',
    database = 'retrowheels'
)

In [20]:
mycursor = mydb.cursor()
query = (
    'Select city, count(city) as employeeNumber From employees e Join offices o On e.officeCode = o.officeCode Group By e.officeCode Order By employeeNumber desc;'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans1 = pd.DataFrame(result, columns=mycursor.column_names)
ans1

            city  employeeNumber
0  San Francisco               6
1          Paris               5
2         Sydney               4
3         Boston               2
4            NYC               2
5          Tokyo               2
6         London               2

In [26]:
mycursor = mydb.cursor()
query = (
        'Select count(distinct(productLine)) as ProductNumberLine, count(productName) as ProductNumber From products;'    
        )
mycursor.execute(query)
result = mycursor.fetchall()
ans2 = pd.DataFrame(result, columns=mycursor.column_names)
ans2

   ProductNumberLine  ProductNumber
0                  7            110

In [31]:
mycursor = mydb.cursor()
query = (
    'Select min(p.productCode) as productCode, productName, min(productLine) as productLine, sum(quantityOrdered) as quantityOrdered From products p Join orderDetails od On p.productCode=od.productCode group by productName order by quantityOrdered desc Limit 5;'    )
mycursor.execute(query)
result = mycursor.fetchall()
ans3 = pd.DataFrame(result, columns=mycursor.column_names)
ans3

,productCode,productName,productLine,quantityOrdered
0,S18_3232,1992 Ferrari 360 Spider red,Classic Cars,1808
1,S18_1342,1937 Lincoln Berline,Vintage Cars,1111
2,S700_4002,American Airlines: MD-11S,Planes,1085
3,S18_3856,1941 Chevrolet Special Deluxe Cabriolet,Vintage Cars,1076
4,S50_1341,1930 Buick Marquette Phaeton,Vintage Cars,1074

In [45]:
mycursor = mydb.cursor()
query = ()
mycursor.execute(query)
result = mycursor.fetchall()
ans4 = pd.DataFrame(result, columns=mycursor.column_names)
ans4

InterfaceError: No result set to fetch from

In [43]:
mycursor = mydb.cursor()
query =  ()
mycursor.execute(query)
result = mycursor.fetchall()
ans5 = pd.DataFrame(result, columns=mycursor.column_names)
ans5

  Tables_in_retrowheels
0             customers
1             employees
2               offices
3          orderdetails
4                orders
5              payments
6          productlines
7              products